Вариант 2. Реализуйте рекурсивную функцию для вычисления степени числа (power(x, n)).
Алгоритм вычисления степени числа
Рекурсивная функция вычисляет x^n, используя свойство быстрого возведения в степень (exponentiation by squaring).
Вместо того чтобы выполнять n умножений, показатель степени делится на 2 при каждом рекурсивном вызове.
Основные случаи:
Если n = 0 → вернуть 1
Если n < 0 → вернуть 1 / power(x, -n)
Если n чётное → x^n = (x^{n/2})^2
Если n нечётное → x^n = x * x^{n-1}
Это значительно сокращает количество операций по сравнению с линейным алгоритмом.

Пошаговое описание работы алгоритма
 1. Проверяем, равен ли показатель степени нулю.
 Если n == 0, возвращаем 1.
 2. Если показатель отрицательный, вызываем power(x, -n) и берём обратное значение.
 3. Если показатель чётный:
 Рекурсивно вычисляем half = power(x, n // 2)
 Возвращаем half * half
 4. Если показатель нечётный:
 Возвращаем x * power(x, n - 1)ализуйте рекурсивную функцию для вычисления степени числа (power(x, n)).


Синтаксические операторы и ключевые слова

Python

def, if, else, return, try, except, input, print

Определение функции, условие, возврат значения, ввод/вывод, обработка исключений

Java 

public, static, double, if, else, return, Scanner, System.out.println

Определение метода, тип данных, ввод/вывод

C++ 

if, else, return, cout, cin, double, using namespace std

Условные операторы, ввод/вывод, тип данных


Временная сложность: O(log n)
Пространственная сложность: O(log n) (из-за глубины рекурсии)


Объяснение временной сложности

На каждом рекурсивном шаге показатель степени n делится на 2, если он чётный.
Количество вызовов функции ≈ log₂(n), т.к.мы делим n пополам каждый раз.
На каждом уровне рекурсии выполняется константное количество операций (умножение и возврат).
Поэтому общая сложность — O(log n).


Пространственная сложность
 • O(log n) — т.к. глубина рекурсии соответствует количеству раз, когда мы делим показатель на 2.

Ответ на вопрос №9: Перестановки и сочетания — это основные понятия комбинаторики, различающиеся тем, учитывается ли порядок элементов.
Перестановка — это расположение всех элементов множества в определённом порядке. При изменении порядка получается новая перестановка.
Сочетание — это выбор некоторых элементов из множества, при котором порядок не имеет значения; важен только состав выбранных элементов.
Иными словами, в перестановках важен порядок, а в сочетаниях — только набор выбранных элементов.
